#### 🖌 Terraform Format and Style 🖌`success`
#### ⚙️ Terraform Initialization ⚙️`success`
#### 📖 Terraform Plan 📖`success`

### 🤖 AI 분석 결과
1. 📊 **변경 요약**:
   - 생성될 리소스:
     - `module.compute.aws_appautoscaling_policy.backend_cpu`
     - `module.compute.aws_appautoscaling_policy.frontend_cpu`
     - `module.compute.aws_appautoscaling_target.backend`
     - `module.compute.aws_appautoscaling_target.frontend`
     - `module.compute.aws_autoscaling_group.gpu_ecs`
     - `module.compute.aws_cloudwatch_log_group.backend`
     - `module.compute.aws_cloudwatch_log_group.frontend`
     - `module.compute.aws_cloudwatch_log_group.video_analysis_gpu`
     - `module.compute.aws_ecr_repository.backend`
     - `module.compute.aws_ecr_repository.frontend`

2. 💰 **비용 영향**: 
   - 새로운 리소스가 생성되므로 전반적인 비용이 증가할 것으로 예상됩니다.
   - 특히 GPU 기반의 ECS 클러스터 및 관련 리소스(예: Auto Scaling Group, CloudWatch Log Group 등)의 비용이 추가될 것입니다.

3. ⚠️ **주의사항**:
   - 이 변경에는 **리소스 삭제가 포함되어 있지 않습니다.**
   - 새로운 ECS 클러스터, ECR 레포지토리, CloudWatch Log Group 등 중요한 인프라가 생성될 예정입니다.
   - 이로 인해 일시적인 다운타임이나 서비스 중단이 발생할 수 있습니다.

4. ✅ **승인 권장사항**:
   - 이 변경은 새로운 인프라를 구축하는 것이므로, 철저한 테스트와 모니터링이 필요합니다.
   - 사전에 변경 내용을 팀과 충분히 검토하고 승인을 받는 것이 좋습니다.
   - 변경 후에는 실제 운영 환경에서의 안정성과 성능을 면밀히 모니터링해야 합니다.
   - 문제 발생 시 신속한 롤백 계획이 마련되어 있어야 합니다.

<details><summary>Show Raw Plan</summary>

```terraform
[command]/home/runner/work/_temp/e30cff93-0853-4d4d-8e01-e26a9ef02a5a/terraform-bin plan -no-color -out=tfplan.binary
module.pipeline.data.archive_file.lambda_zip: Reading...
module.pipeline.data.archive_file.lambda_zip: Read complete after 0s [id=b63a869c5b755127ab623723d028d398c83db8df]
data.aws_caller_identity.current: Reading...
module.pipeline.data.aws_ami.custom_gpu: Reading...
module.pipeline.data.aws_ami.ecs_gpu: Reading...
module.compute.data.aws_ecs_cluster.main: Reading...
module.compute.data.aws_ami.ecs_gpu: Reading...
module.pipeline.data.aws_ecr_repository.ai_batch: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=287709190208]
module.pipeline.data.aws_ami.custom_gpu: Read complete after 1s [id=ami-074d96b4a13784644]
module.pipeline.data.aws_ecr_repository.ai_batch: Read complete after 1s [id=capstone-dev-batch-processor]
module.compute.data.aws_ami.ecs_gpu: Read complete after 1s [id=ami-047d087e61e36673e]
module.pipeline.data.aws_ami.ecs_gpu: Read complete after 1s [id=ami-047d087e61e36673e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.compute.aws_appautoscaling_policy.backend_cpu will be created
  + resource "aws_appautoscaling_policy" "backend_cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "capstone-backend-cpu-scaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/capstone-cluster/capstone-backend-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 70

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.compute.aws_appautoscaling_policy.frontend_cpu will be created
  + resource "aws_appautoscaling_policy" "frontend_cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "capstone-frontend-cpu-scaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/capstone-cluster/capstone-frontend-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in = false
          + target_value     = 70

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.compute.aws_appautoscaling_target.backend will be created
  + resource "aws_appautoscaling_target" "backend" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 4
      + min_capacity       = 1
      + resource_id        = "service/capstone-cluster/capstone-backend-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)
    }

  # module.compute.aws_appautoscaling_target.frontend will be created
  + resource "aws_appautoscaling_target" "frontend" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 4
      + min_capacity       = 1
      + resource_id        = "service/capstone-cluster/capstone-frontend-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = (known after apply)
    }

  # module.compute.aws_autoscaling_group.gpu_ecs will be created
  + resource "aws_autoscaling_group" "gpu_ecs" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 0
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 0
      + metrics_granularity              = "1Minute"
      + min_size                         = 0
      + name                             = "c
```

</details>

*Pusher: @siheon012, Action: `pull_request`*